In [62]:
import numpy as np
import pandas as pd

In [63]:
subs = pd.read_csv('C:\projects\pyprojects\data_science\z_Dataset\subs.csv')
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [64]:
vk = pd.read_csv('C:\projects\pyprojects\data_science\z_Dataset\kohli_ipl.csv',index_col='match_no')
vk

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [65]:
movies = pd.read_csv(r'C:\projects\pyprojects\data_science\z_Dataset\bollywood.csv',index_col='movie')
movies

                                                  lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar
...                                                ...
Hum Tumhare Hain Sanam                  Shah Rukh Khan
Aankhen (2002 film)                   Amitabh Bachchan
Saathiya (film)                           Vivek Oberoi
Company (film)                              Ajay Devgn
Awara Paagal Deewana                      Akshay Kumar

[1500 rows x 1 columns]

In [66]:
#astype
import sys
sys.getsizeof(vk)

3456

In [67]:
sys.getsizeof(vk.astype('int16'))

2166

In [68]:
# clips
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [69]:
subs.clip(100,200)

     Subscribers gained
0                   100
1                   100
2                   100
3                   100
4                   100
..                  ...
360                 200
361                 200
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [70]:
# drop_duplicates
temp = pd.Series([1,1,2,2,3,3,4,4])
temp

0    1
1    1
2    2
3    2
4    3
5    3
6    4
7    4
dtype: int64

In [71]:
temp.drop_duplicates()

0    1
2    2
4    3
6    4
dtype: int64

In [72]:
temps = pd.Series([1,2,3,np.nan,5,6,np.nan,8,np.nan,10])
temps

0     1.0
1     2.0
2     3.0
3     NaN
4     5.0
5     6.0
6     NaN
7     8.0
8     NaN
9    10.0
dtype: float64

In [73]:
print(temps.size) # it gives the size of series
temps.count() # it gives count of not null value

10

7

In [74]:
# isnull
temps.isnull().sum() # counts the null value

3

In [75]:
# dropna
temps.dropna() # drops the missing value

0     1.0
1     2.0
2     3.0
4     5.0
5     6.0
7     8.0
9    10.0
dtype: float64

In [76]:
# fillna
temps.fillna(temp.mean()) # fill the null values

0     1.0
1     2.0
2     3.0
3     2.5
4     5.0
5     6.0
6     2.5
7     8.0
8     2.5
9    10.0
dtype: float64

In [79]:
# isin 
vk[vk.isin([49,99])]

          runs
match_no
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
...        ...
211        NaN
212        NaN
213        NaN
214        NaN
215        NaN

[215 rows x 1 columns]

In [81]:
# apply
movies

                                                  lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar
...                                                ...
Hum Tumhare Hain Sanam                  Shah Rukh Khan
Aankhen (2002 film)                   Amitabh Bachchan
Saathiya (film)                           Vivek Oberoi
Company (film)                              Ajay Devgn
Awara Paagal Deewana                      Akshay Kumar

[1500 rows x 1 columns]